竺可桢学院工程教育高级班/组B3_A2P2卢泽熙/工高实践面/实践面附件/附件/shockTube/0/mag(U)
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      mag(U);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform 1.7;

boundaryField
{
    sides_in
    {
        type            calculated;
        value           uniform 2;
    }
    sides_out
    {
        type            calculated;
        value           uniform 1.7;
    }
    empty
    {
        type            empty;
    }
}


// ************************************************************************* //
