竺可桢学院工程教育高级班/组B3_A2P2卢泽熙/工高实践面/实践面附件/附件/shockTube/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0.85;

boundaryField
{
    sides_in
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    sides_out
    {
        /*
        type            inletOutlet;
        inletValue      uniform 0.05;
        value           uniform 0.05;
        */
        type            fixedValue;
        value           uniform 0.7;
    }
    empty
    {
        type            empty;
    }
}


// ************************************************************************* //
