竺可桢学院工程教育高级班/组B3_A2P2卢泽熙/工高实践面/实践面附件/附件/shockTube/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=$(getApplication)

runApplication blockMesh
runApplication setFields
runApplication $application
runApplication -s sample  postProcess -func sample

#------------------------------------------------------------------------------
