竺可桢学院工程教育高级班/组B3_A2P2卢泽熙/工高实践面/实践面附件/附件/shockTube/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (0 -1.5 0)
    (3 -1.5 0)
    (3 1.5 0)
    (0 1.5 0)
    (0 -1.5 1)
    (3 -1.5 1)
    (3 1.5 1)
    (0 1.5 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1000 1 1) simpleGrading (1 1 1)
);

edges
(
    arc 0 1 (1.5 -0.5 0)
    arc 2 3 (1.5 0.5 0)
    arc 4 5 (1.5 -0.5 1)
    arc 6 7 (1.5 0.5 1)
);

boundary
(
    sides_in
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    sides_out
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    empty
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (5 6 7 4)
            (3 7 6 2)
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
