竺可桢学院工程教育高级班/组B3_A2P2卢泽熙/工高实践面/实践面附件/附件/shockTube/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues ( volVectorFieldValue U (1.7 0 0) volScalarFieldValue T 0.5 volScalarFieldValue p 0.175);


regions( 
     boxToCell { box (0 -1 -1) (5 1 1) ; 
		fieldValues (volVectorFieldValue U (0.7 0 0) volScalarFieldValue T 0.8 volScalarFieldValue p 0.56 ) ; 
	}
);



// ************************************************************************* //
